Add required diagrams
